---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilteredElementIdIterator
source: html/4ab102b5-b185-7191-4770-573807ff2fcb.htm
---
# FilteredElementIdIterator Methods

The current element id found by the iterator.